package com.boukreev.template_spring_boot.controllers;


import org.json.simple.JSONObject;
import org.json.simple.parser.JSONParser;
import org.springframework.http.ResponseEntity;
import org.springframework.stereotype.Controller;
import org.springframework.web.bind.annotation.GetMapping;
import org.springframework.web.bind.annotation.RequestMapping;

import java.io.FileReader;
import java.nio.file.Files;
import java.nio.file.Paths;
import java.util.ArrayList;
import java.util.List;

@Controller
public class EventController {

    @GetMapping("/event")
    public ResponseEntity<EventResponse> getEvents() {
        EventResponse response = new EventResponse();
        List<Event> list = createList();
        response.setEvents(list);
        return ResponseEntity.ok(response);
    }

    @GetMapping("/schedule")
    public ResponseEntity<JSONObject> getSchedule() {
        String response = "";
        JSONObject jsonObj = null;
        try {
            var uri = getClass().getResource(String.format("/%s", "schedule.json")).toURI();
            response =  Files.readString(Paths.get(uri));
            JSONParser parser = new JSONParser();
            Object obj = parser.parse(response);
            jsonObj = (JSONObject) obj;
        } catch (Exception ex) {
            response = "File schedule.json not found";
        }
        System.out.println(jsonObj);
        return ResponseEntity.ok(jsonObj);
    }

    private List<Event> createList() {
        List<Event> list = new ArrayList<>();
        /** 10.10.2023 */
        list.add(new Event(1, 1, "10.10.2023", "10:00", "11:30", "Зал пленарных заседаний", "Пленарное заседание. Приветственные обращения", ""));
        list.add(new Event(1, 1, "10.10.2023", "12:00", "13:30", "Зал пленарных заседаний", "Пленарное заседание. Приветственные обращения", ""));
        list.add(new Event(1, 1, "10.10.2023", "15:00", "16:30", "Зал пленарных заседаний", "Пленарное заседание. Доверенные электронные системы и ПАК для критической гражданской инфраструктуры", ""));
        list.add(new Event(1, 1, "10.10.2023", "17:00", "18:30", "Зал пленарных заседаний", "Пленарное заседание. Доверенные электронные системы и ПАК для критической гражданской инфраструктуры", ""));
        list.add(new Event(1, 1, "10.10.2023", "18:00", "22:00", "Место проведения на согласовании", "Закрытый деловой ужин АКРП «Разработчики электроники – отраслевые инициативы в интересах устойчивого развития", ""));

        /** 11.10.2023 */
        list.add(new Event(1, 1, "11.10.2023", "08:00", "10:00", "Фойе зала Атом", "Трек обзорно-дискуссионных заседаний \"Доверенные РЭУ и ЭКБ для критической гражданской инфраструктуры\"", ""));
        list.add(new Event(1, 1, "11.10.2023", "08:00", "10:00", "Фойе зала Атом", "Бизнес- завтрак ГК «Росатом» «Кадровое обеспечение технологической независимости: подготовка специалистов для обеспечения и развития критической информационной инфраструктуры", ""));
        list.add(new Event(1, 1, "11.10.2023", "10:00", "11:30", "Зал пленарных заседаний", "Пленарное заседание. Искусственный и гибридный интеллект: ЭКБ на новых принципах, алгоритмы, модели и технологии", ""));
        list.add(new Event(1, 1, "11.10.2023", "12:00", "13:30", "Зал пленарных заседаний", "Пленарное заседание. Искусственный и гибридный интеллект: ЭКБ на новых принципах, алгоритмы, модели и технологии", ""));
        list.add(new Event(1, 1, "11.10.2023", "15:00", "16:30", "Зал пленарных заседаний", "\"Пленарное заседание. " +
                "Развитие отечественного электронного машиностроения в новых экономических условиях: от дорожной карты к долгосрочной стратегии\"", ""));

        list.add(new Event(1, 1, "11.10.2023", "17:00", "18:30", "Зал 14", "Круглый стол, организатор Сбербанк, «Сессия с предварительной регистрацией «Специализированное ПО для производства на базе искусственного интеллекта»", ""));
        list.add(new Event(1, 1, "11.10.2023", "17:00", "18:30", "Зал 15", "Круглый стол, на базе секции №9 \"Текущее состояние работ по созданию оборудования для формирования топологического рисунка\" (Закрытое мероприятие)", ""));
        list.add(new Event(1, 1, "11.10.2023", "17:00", "18:30", "Зал 13", "Панельная дискуссия, организатор АО «Элемент» «Совместные проекты крупных технологических компаний как основа для развития гражданской микроэлектроники»", ""));
        list.add(new Event(1, 1, "11.10.2023", "17:00", "18:30", "Зал 12.2", "Круглый стол, на базе секции №3 \"Кадровое обеспечение электронной промышленности\"", ""));
        list.add(new Event(1, 1, "11.10.2023", "17:00", "18:30", "Зал 12.1", "Круглый стол, организатор Микрон, \"Технологический суверенитет в радиоэлектронной промышленности\"", ""));

        /** 12.10.2023 */
        list.add(new Event(1, 1, "12.10.2023", "10:00", "11:30", "Зал Атом", "Заседание 1. Состояние и перспективы создания доверенных ПАК для объектов критической информационной инфраструктуры", ""));
        list.add(new Event(1, 1, "12.10.2023", "09:00", "11:30", "Зал 1", "Секция №1 Навигационно-связные СБИС и модули", ""));
        list.add(new Event(1, 1, "12.10.2023", "09:00", "11:30", "Зал 2", "Секция №2 Высокопроизводительные вычислительные системы", ""));
        list.add(new Event(1, 1, "12.10.2023", "09:00", "11:30", "Зал 3", "Секция №3 Информационно-управляющие и радиотехнические системы", ""));
        list.add(new Event(1, 1, "12.10.2023", "09:00", "11:30", "Зал 4", "Секция №4 Технологии и компоненты микро- и наноэлектроники", ""));
        list.add(new Event(1, 1, "12.10.2023", "09:00", "11:30", "Зал 6", "Секция №6 Системы проектирования и моделирования электронных компонентов и систем", ""));
        list.add(new Event(1, 1, "12.10.2023", "09:00", "11:30", "Зал 7", "Секция №7 СВЧ интегральные схемы и модули", ""));
        list.add(new Event(1, 1, "12.10.2023", "09:00", "11:30", "Зал 8", "Секция №8 Микросистемы. Сенсоры и актюаторы", ""));
        list.add(new Event(1, 1, "12.10.2023", "09:00", "11:30", "Зал 9", "Секция №9 Специальное технологическое оборудование", ""));
        list.add(new Event(1, 1, "12.10.2023", "09:00", "11:30", "Зал 10", "Секция №10 Нейроморфные вычисления. Искусственный интеллект", ""));
        list.add(new Event(1, 1, "12.10.2023", "09:00", "11:30", "Зал 11", "Секция №11 Квантовые технологии – квантовые коммуникации", ""));
        list.add(new Event(1, 1, "12.10.2023", "09:00", "11:30", "Зал 12.1", "Секция №12.1 Технологии оптоэлектроники", ""));
        list.add(new Event(1, 1, "12.10.2023", "09:00", "11:30", "Зал 12.2", "Секция №12.2 Интегральная фотоника, волоконные и лазерные технологии", ""));
        list.add(new Event(1, 1, "12.10.2023", "09:00", "11:30", "Зал 13", "Секция №13 Материалы микро- и наноэлектроники, диагностика материалов и элементов электронной компонентной базы", ""));

        list.add(new Event(1, 1, "12.10.2023", "12:00", "13:30", "Зал Атом", "Заседание 2. Системные вопросы обеспечения доверенности РЭУ и ЭКБ", ""));
        list.add(new Event(1, 1, "12.10.2023", "12:00", "13:30", "Зал 1", "Секция №1 Навигационно-связные СБИС и модули", ""));
        list.add(new Event(1, 1, "12.10.2023", "12:00", "13:30", "Зал 2", "Секция №2 Высокопроизводительные вычислительные системы", ""));
        list.add(new Event(1, 1, "12.10.2023", "12:00", "13:30", "Зал 3", "Секция №3 Информационно-управляющие и радиотехнические системы", ""));
        list.add(new Event(1, 1, "12.10.2023", "12:00", "13:30", "Зал 4", "Секция №4 Технологии и компоненты микро- и наноэлектроники", ""));
        list.add(new Event(1, 1, "12.10.2023", "12:00", "13:30", "Зал 6", "Секция №6 Системы проектирования и моделирования электронных компонентов и систем", ""));
        list.add(new Event(1, 1, "12.10.2023", "12:00", "13:30", "Зал 7", "Секция №7 СВЧ интегральные схемы и модули", ""));
        list.add(new Event(1, 1, "12.10.2023", "12:00", "13:30", "Зал 8", "Секция №8 Микросистемы. Сенсоры и актюаторы", ""));
        list.add(new Event(1, 1, "12.10.2023", "12:00", "13:30", "Зал 9", "Секция №9 Специальное технологическое оборудование", ""));
        list.add(new Event(1, 1, "12.10.2023", "12:00", "13:30", "Зал 10", "Секция №10 Нейроморфные вычисления. Искусственный интеллект", ""));
        list.add(new Event(1, 1, "12.10.2023", "12:00", "13:30", "Зал 11", "Секция №11 Квантовые технологии – квантовые коммуникации", ""));
        list.add(new Event(1, 1, "12.10.2023", "12:00", "13:30", "Зал 12.1", "Секция №12.1 Технологии оптоэлектроники", ""));
        list.add(new Event(1, 1, "12.10.2023", "12:00", "13:30", "Зал 12.2", "Секция №12.2 Интегральная фотоника, волоконные и лазерные технологии", ""));
        list.add(new Event(1, 1, "12.10.2023", "12:00", "13:30", "Зал 13", "Секция №13 Материалы микро- и наноэлектроники, диагностика материалов и элементов электронной компонентной базы", ""));
        list.add(new Event(1, 1, "12.10.2023", "12:00", "13:30", "Зал 14", "Круглый стол, организатор Минпромторг \"Заседание индустриального центра компетенций (ИЦК) «Электроника и микроэлектроника\"", ""));
        list.add(new Event(1, 1, "12.10.2023", "12:00", "13:30", "Зал 15", "Круглый стол, организатор ФПИ \"Перспективные направления развития электроники\" (Непубличное мероприятие)", ""));


        list.add(new Event(1, 1, "12.10.2023", "15:00", "16:30", "Зал Атом", "Заседание 3. Обеспечение и контроль доверенности ЭКБ в процессе разработки", ""));
        list.add(new Event(1, 1, "12.10.2023", "15:00", "16:30", "Зал 1", "Круглый стол, на базе секции №13 \"Диагностика и материаловедение материалов для микро- и наноэлектроники\"", ""));
        list.add(new Event(1, 1, "12.10.2023", "15:00", "16:30", "Зал 3", "Круглый стол, организатор НМ-ТЕХ «Экосистемные рецепты НМ-ТЕХ» Часть 1 (Закрытое мероприятие)", ""));
        list.add(new Event(1, 1, "12.10.2023", "15:00", "16:30", "Зал 4", "Круглый стол, на базе секции №4 \"Проблемы и пути развития отечественных технологий и производств микроэлектроники, и оптоэлектроники в современных условиях\"", ""));
        list.add(new Event(1, 1, "12.10.2023", "15:00", "16:30", "Зал 6", "Круглый стол, на базе секции №3, 6 \"Актуальные вопросы создания отечественных САПР и маршрутов проектирования ЭКБ и электронных модулей\" Часть 1", ""));
        list.add(new Event(1, 1, "12.10.2023", "15:00", "16:30", "Зал 7", "Круглый стол, на базе секции №11 \"Квантовый компьютер на ионах в ловушке с облачным доступом\"", ""));
        list.add(new Event(1, 1, "12.10.2023", "15:00", "16:30", "Зал 8", "Круглый стол, организатор Алмазный Кластер \"Проблемы и перспективы развития рынка новых материалов на примере алмаза\"", ""));
        list.add(new Event(1, 1, "12.10.2023", "15:00", "16:30", "Зал 10", "Круглый стол, на базе секции №9 \"Формирование условий для ускоренного развития отрасли электронное машиностроение\"", ""));
        list.add(new Event(1, 1, "12.10.2023", "15:00", "16:30", "Зал 13", "Круглый стол,организатор АО \"НИИМА \"Прогресс\", Консорциум «Автоэлектроника и телематика» \"Российские электронные компоненты для автомобильной промышленности\" Часть 1", ""));
        list.add(new Event(1, 1, "12.10.2023", "15:00", "16:30", "Зал 15", "Круглый стол, организатор Сбербанк, «Открытая сессия «RISC-V: готовность ПО и экосистемы»  Часть 1", ""));


        /** 13.10.2023 */
        list.add(new Event(1, 1, "12.10.2023", "17:00", "18:30", "Зал 12.1", "Круглый стол, о", ""));

        list.add(new Event(1, 1, "12.10.2023", "17:00", "18:30", "Зал 12.1", "Круглый стол, о", ""));
        return list;
    }
}
